<!-- Terragrunt PR Comment -->
## 📋 Terragrunt PLAN summary

**Step URL:** https://github.com/proxmox-home-lab/.github/actions/runs/23171296932/job/67323525678#step:8:1

**Changed Stacks:**
- `github` (`iac/prod/github`)

| Stack | Stack Path | Unit | Result | Summary |
|---|---|---|---:|---|
| `github` | `iac/prod/github` | `repo-github-actions` | ✏️ | Plan: 2 to add, 1 to change, 0 to destroy. |
| `github` | `iac/prod/github` | `repo-github-org` | ✏️ | Plan: 1 to import, 2 to add, 1 to change, 0 to destroy. |
| `github` | `iac/prod/github` | `repo-infrastructure-catalog` | ✏️ | Plan: 2 to add, 1 to change, 0 to destroy. |
| `github` | `iac/prod/github` | `repo-packer-images` | ✏️ | Plan: 2 to add, 1 to change, 0 to destroy. |
| `github` | `iac/prod/github` | `teams-platform` | ✏️ | Plan: 2 to add, 0 to change, 0 to destroy. |

<details><summary><b>✏️ github (iac/prod/github) / repo-github-actions</b></summary>

```diff
Acquiring state lock. This may take a few moments...
github_repository.default[0]: Refreshing state... [id=github-actions]
github_branch_default.default[0]: Refreshing state... [id=github-actions]

OpenTofu will perform the following actions:
  # github_repository.default[0] will be updated in-place
  ~ resource "github_repository" "default" {
        id                                      = "github-actions"
        name                                    = "github-actions"
      ~ topics                                  = [
          - "githubss",
          + "github",
            # (2 unchanged elements hidden)
        ]
        # (36 unchanged attributes hidden)
        # (1 unchanged block hidden)
    }
  # github_repository_file.codeowners[0] will be created
  + resource "github_repository_file" "codeowners" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "main"
      + commit_author                = "github-actions[bot]"
      + commit_email                 = "github-actions[bot]@users.noreply.github.com"
      + commit_message               = "chore: update CODEOWNERS [skip ci]"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            /.github/ @proxmox-home-lab/platform
            * @proxmox-home-lab/platform
        EOT
      + file                         = ".github/CODEOWNERS"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "github-actions"
      + repository_id                = (known after apply)
      + sha                          = (known after apply)
    }
  # github_repository_ruleset.default["default_branch_protection"] will be created
  + resource "github_repository_ruleset" "default" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "default-branch-protection"
      + node_id     = (known after apply)
      + repository  = "github-actions"
      + ruleset_id  = (known after apply)
      + target      = "branch"
      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }
      + rules {
          + creation                      = false
          + deletion                      = true
          + non_fast_forward              = true
          + update_allows_fetch_and_merge = false
          + pull_request {
              + allowed_merge_methods             = (known after apply)
              + dismiss_stale_reviews_on_push     = true
              + require_code_owner_review         = true
              + require_last_push_approval        = false
              + required_approving_review_count   = 1
              + required_review_thread_resolution = false
            }
        }
    }
```

</details>

<details><summary><b>✏️ github (iac/prod/github) / repo-github-org</b></summary>

```diff
Acquiring state lock. This may take a few moments...
github_repository.default[0]: Refreshing state... [id=.github]

OpenTofu will perform the following actions:
  # github_repository.default[0] will be updated in-place
  # (imported from ".github")
  ~ resource "github_repository" "default" {
        allow_auto_merge                        = false
        allow_forking                           = true
        allow_merge_commit                      = true
        allow_rebase_merge                      = true
        allow_squash_merge                      = true
        allow_update_branch                     = false
        archived                                = false
        auto_init                               = false
        default_branch                          = "main"
        delete_branch_on_merge                  = false
      ~ description                             = "GitHub Organization use for & organization configuration as IaC" -> "GitHub organization defaults and IaC for proxmox-home-lab"
        etag                                    = "W/\"513c82f03b6f758515f671d040bcd3aeecd3775536df46b51f586a2f4f21030c\""
        fork                                    = "false"
        full_name                               = "proxmox-home-lab/.github"
        git_clone_url                           = "git://github.com/proxmox-home-lab/.github.git"
        has_discussions                         = false
      - has_downloads                           = true -> null
        has_issues                              = true
        has_projects                            = true
      ~ has_wiki                                = true -> false
        html_url                                = "https://github.com/proxmox-home-lab/.github"
        http_clone_url                          = "https://github.com/proxmox-home-lab/.github.git"
        id                                      = ".github"
      + ignore_vulnerability_alerts_during_read = false
        is_template                             = false
        merge_commit_message                    = "PR_TITLE"
        merge_commit_title                      = "MERGE_MESSAGE"
        name                                    = ".github"
        node_id                                 = "R_kgDOPVaHaQ"
        primary_language                        = "Shell"
        private                                 = false
        repo_id                                 = 1029080937
        squash_merge_commit_message             = "COMMIT_MESSAGES"
        squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
        ssh_clone_url                           = "git@github.com:proxmox-home-lab/.github.git"
        svn_url                                 = "https://github.com/proxmox-home-lab/.github"
      ~ topics                                  = [
          + "github",
          + "iac",
        ]
        visibility                              = "public"
        vulnerability_alerts                    = true
        web_commit_signoff_required             = false
        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }
  # github_repository_file.codeowners[0] will be created
  + resource "github_repository_file" "codeowners" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "main"
      + commit_author                = "github-actions[bot]"
      + commit_email                 = "github-actions[bot]@users.noreply.github.com"
      + commit_message               = "chore: update CODEOWNERS [skip ci]"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            /.github/ @proxmox-home-lab/platform
            * @proxmox-home-lab/platform
        EOT
      + file                         = ".github/CODEOWNERS"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = ".github"
      + repository_id                = (known after apply)
      + sha                          = (known after apply)
    }
  # github_repository_ruleset.default["default_branch_protection"] will be created
  + resource "github_repository_ruleset" "default" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "default-branch-protection"
      + node_id     = (known after apply)
      + repository  = ".github"
      + ruleset_id  = (known after apply)
      + target      = "branch"
      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }
      + rules {
          + creation                      = false
          + deletion                      = true
          + non_fast_forward              = true
          + update_allows_fetch_and_merge = false
          + pull_request {
              + allowed_merge_methods             = (known after apply)
              + dismiss_stale_reviews_on_push     = true
              + require_code_owner_review         = true
              + require_last_push_approval        = false
              + required_approving_review_count   = 1
              + required_review_thread_resolution = false
            }
          + required_status_checks {
              + do_not_enforce_on_create             = false
              + strict_required_status_checks_policy = false
              + required_check {
                  + context        = "plan / plan"
                  + integration_id = 0
                }
            }
        }
    }
```

</details>

<details><summary><b>✏️ github (iac/prod/github) / repo-infrastructure-catalog</b></summary>

```diff
Acquiring state lock. This may take a few moments...
github_repository.default[0]: Refreshing state... [id=infrastructure-catalog]
github_branch_default.default[0]: Refreshing state... [id=infrastructure-catalog]

OpenTofu will perform the following actions:
  # github_repository.default[0] will be updated in-place
  ~ resource "github_repository" "default" {
        id                                      = "infrastructure-catalog"
        name                                    = "infrastructure-catalog"
      ~ topics                                  = [
          - "githubss",
          + "github",
            # (2 unchanged elements hidden)
        ]
        # (37 unchanged attributes hidden)
        # (1 unchanged block hidden)
    }
  # github_repository_file.codeowners[0] will be created
  + resource "github_repository_file" "codeowners" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "main"
      + commit_author                = "github-actions[bot]"
      + commit_email                 = "github-actions[bot]@users.noreply.github.com"
      + commit_message               = "chore: update CODEOWNERS [skip ci]"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            /.github/ @proxmox-home-lab/platform
            * @proxmox-home-lab/platform
        EOT
      + file                         = ".github/CODEOWNERS"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "infrastructure-catalog"
      + repository_id                = (known after apply)
      + sha                          = (known after apply)
    }
  # github_repository_ruleset.default["default_branch_protection"] will be created
  + resource "github_repository_ruleset" "default" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "default-branch-protection"
      + node_id     = (known after apply)
      + repository  = "infrastructure-catalog"
      + ruleset_id  = (known after apply)
      + target      = "branch"
      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }
      + rules {
          + creation                      = false
          + deletion                      = true
          + non_fast_forward              = true
          + update_allows_fetch_and_merge = false
          + pull_request {
              + allowed_merge_methods             = (known after apply)
              + dismiss_stale_reviews_on_push     = true
              + require_code_owner_review         = true
              + require_last_push_approval        = false
              + required_approving_review_count   = 1
              + required_review_thread_resolution = false
            }
        }
    }
```

</details>

<details><summary><b>✏️ github (iac/prod/github) / repo-packer-images</b></summary>

```diff
Acquiring state lock. This may take a few moments...
github_repository.default[0]: Refreshing state... [id=packer-images]
github_branch_default.default[0]: Refreshing state... [id=packer-images]

OpenTofu will perform the following actions:
  # github_repository.default[0] will be updated in-place
  ~ resource "github_repository" "default" {
      ~ description                             = "Packer Images for proxmox VM" -> "Packer images for Proxmox VMs"
        id                                      = "packer-images"
        name                                    = "packer-images"
      ~ topics                                  = [
          - "githubss",
          + "github",
            # (2 unchanged elements hidden)
        ]
        # (35 unchanged attributes hidden)
        # (1 unchanged block hidden)
    }
  # github_repository_file.codeowners[0] will be created
  + resource "github_repository_file" "codeowners" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "main"
      + commit_author                = "github-actions[bot]"
      + commit_email                 = "github-actions[bot]@users.noreply.github.com"
      + commit_message               = "chore: update CODEOWNERS [skip ci]"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            /.github/ @proxmox-home-lab/platform
            * @proxmox-home-lab/platform
        EOT
      + file                         = ".github/CODEOWNERS"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "packer-images"
      + repository_id                = (known after apply)
      + sha                          = (known after apply)
    }
  # github_repository_ruleset.default["default_branch_protection"] will be created
  + resource "github_repository_ruleset" "default" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "default-branch-protection"
      + node_id     = (known after apply)
      + repository  = "packer-images"
      + ruleset_id  = (known after apply)
      + target      = "branch"
      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }
      + rules {
          + creation                      = false
          + deletion                      = true
          + non_fast_forward              = true
          + update_allows_fetch_and_merge = false
          + pull_request {
              + allowed_merge_methods             = (known after apply)
              + dismiss_stale_reviews_on_push     = true
              + require_code_owner_review         = true
              + require_last_push_approval        = false
              + required_approving_review_count   = 1
              + required_review_thread_resolution = false
            }
        }
    }
```

</details>

<details><summary><b>✏️ github (iac/prod/github) / teams-platform</b></summary>

```diff
Acquiring state lock. This may take a few moments...

OpenTofu will perform the following actions:
  # github_team.this will be created
  + resource "github_team" "this" {
      + create_default_maintainer = false
      + description               = "Platform team with permission to approve IaC deployments"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "platform"
      + node_id                   = (known after apply)
      + notification_setting      = "notifications_enabled"
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }
  # github_team_membership.this["sergioaten"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "sergioaten"
    }
```

</details>